#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Очистка консоли

python trml/samples/clear.py
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
# Персональные
from trml.shell import Shell  # Работа с Shell


# ######################################################################################################################
# Выполняем только в том случае, если файл запущен сам по себе
# ######################################################################################################################
def main():
    Shell.clear()  # Очистка консоли


if __name__ == "__main__":
    main()
